#include <iostream>
#include <queue> // черга
using namespace std;
int main()
{
  queue <int> Queue;
  int mas[9][9] = { { 0, 1, 0,0,0,0,1,1,0 }, // матриця суміжності
  { 1,0,1,1,0,1,1,0,1 },
  { 0,1,0,1,0,0,0,1,0 },
  { 0,1,1,0,1,0,0,1,0 },
  { 0,0,0,1,0,1,1,1,0 },
  { 0,1,0,0,1,0,1,1,0 },
  { 1,1,0,0,1,1,0,1,0 },
  { 1,0,1,1,1,1,1,0,0 },
  { 0,1,0,0,0,0,0,0,0 } };
  int nodes[9]; // вершини графа
  for (int i = 0; i < 9; i++)
  nodes[i] = 0; //  всі вершини рівні 0
  Queue.push(0); // ставлю в чергу першу вершину
  while (!Queue.empty())//поки черга не пуста
  {
    int node = Queue.front(); // витягую вершину
    Queue.pop();
    nodes[node] = 2; // помічаю її як пройдену
    for (int j = 0; j < 9; j++)
        { // перевіряю для неї всі суміжні вершини
      if (mas[node][j] == 1 && nodes[j] == 0)
      { // якщо вершина суміжна і ще не в черзі
        Queue.push(j); // добавляємо її в чергу
        nodes[j] = 1; // помічаю вершину як пройдену
      }
    }
    cout << node + 1 << endl; // виводжу номер вершини
}
  cin.get();
  return 0;
}
